TextIn.addEventListener('input', e => TextOut.innerText = e.target.value)

//_________________________________________________↓_угадай число_↓__________________________________________________

let number = 7;
let result = false;

while (!result) {
  let answer = prompt('Угадай число от 1 до 10?');
  if (answer === null) {
    break;
  };
  switch (+answer) {
    case number - 2:
    case number + 2:
      alert('Уже теплее!');
      break;
    case number - 1:
    case number + 1:
      alert('Горячо!');
      break;
    case number:
      alert(`Ты угадал! Это число ${number}.`);
      result = true;
      break;
    default:
      alert('Холодно!');
  };
};

//_________________________________________________↑_угадай число_↑__________________________________________________

//_________________________________________________↓_сложение через prompt_↓__________________________________________________
alert("Сложение чисел. Ок-добавить число. Отмена- получить сумму.")

let sum = 0;

while (true) {

  let value = +prompt("Введите число", '');

  if (!value) break; 
  sum += value;

}
alert( 'Сумма: ' + sum );

//_________________________________________________↑_сложение через prompt_↑__________________________________________________

//_________________________________________________↓_Запрос пароля_↓__________________________________________________
alert("Запрос нужного имени (Админ) и пароля (123)")

let names = prompt ('Кто там?', '');
let pass 
if (names == 'Админ') {
    pass = prompt ('Пароль?', '');

        if (pass == '123') {
            alert ('Здравствуйте!');} 
        else if (pass = null || pass == '') {
            alert ('Отменено');} 
        else { alert ('Неверный пароль');} } 
else if (names == '' || names == null ) {
    alert ('Отменено'); } 
else { alert ('Я Вас не знаю'); }

//_________________________________________________↑_Запрос пароля_↑__________________________________________________
